// "© Copyright 2004-2013, 2015-2016 HP Development Company, L.P."

TaskName = "Verkkoasetukset";
HSDTaskName = "Verkkoasetukset";

ApplySettingsErrorHostNameFailed = "Isäntänimeä ei ole määritetty. Varmista, että sen muoto kelpaa.";
AddressInUseError = "Määritetty IP-osoite on jo käytössä.";
AddressInUseErrorExplanation = "Valitse toinen IP-osoite.";
IncorrectMaskErrorExplanation = "Väärä aliverkon peite. Ota yhteyttä verkonvalvojaan saadaksesi ohjeita.";

IncorrectHostNameError = "Isäntänimessä on liian monta merkkiä.";
IncorrectIpAddressError = "Virheellinen IP-osoitteen muoto.";
ManualAddressEmptyError = "\"IP-osoite\" -kenttää ei voi jättää tyhjäksi.";
ManualAddressEmptyExplanation = "Määritä kelvollinen manuaalinen osoite.";
ManualAddressWithPrefixExplanation = "Anna kelvollinen IP-osoite ja etuliitteen pituus väliltä 1–128.";
ManualAddressNotIPv4Explanation = "Anna kelvollinen IP-osoite.";

STATELESS = "Reititin";

ipV4TabName = "IPv4";
ipV6TabName = "IPv6";
OtherTabName = "Muut asetukset";

kCheckChangesAlertTitleKey = "Olet muuttanut tietoja. Haluatko jatkaa?";
kCheckChangesAlertContinueButtonTitleKey = "Jatka";
kCheckChangesAlertCancelButtonTitleKey = "Peruuta";
kCheckChangesAlertMessageKey = "Jos jatkat, kaikki muutokset poistetaan. Voit hylätä toimet ja jatkaa käsittelyä napsauttamalla Peruuta-painiketta.";

TaskNameTiger = "Bonjour-asetukset";
NoService = "Palvelu ei ole käytettävissä.";
NoBonjourName = "ei käytettävissä";

1ServiceName = "Port 9100";
2ServiceName = "IPP";
3ServiceName = "LPD-RAW";
4ServiceName = "LPD-TEXT";
5ServiceName = "LPD-AUTO";
6ServiceName = "LPD-BINPS";
7ServiceName = "LPD-Queue5";
8ServiceName = "LPD-Queue6";
9ServiceName = "LPD-Queue7";
10ServiceName = "LPD-Queue8";
11ServiceName = "LPD-Queue9";
12ServiceName = "LPD-Queue10";
13ServiceName = "LPD";
16ServiceName = "IPPS";

IPPSecureServiceName = "IPP (vain suojattu)";
IPPUnsecureServiceName = "IPP (vain suojaamaton)";

IncorrectConfigurationTitle = "Määritetty kokoonpano on virheellinen";
IncorrectConfigurationExplanation = "Valitse oikea kokoonpano tai ota yhteys verkon järjestelmänvalvojaan.";

IncorrectDNSServerErrorExplanation = "Anna oikea DNS-palvelimen osoite tai ota yhteyttä verkon järjestelmänvalvojaan.";
IncorrectGatewayAddressTitle = "Annettu yhdyskäytävän osoite on virheellinen";
IncorrectGatewayErrorExplanation = "Kirjoita kelvollinen yhdyskäytävän osoite tai pyydä apua järjestelmänvalvojalta.";
GatewayIsNotInSubnetTitle = "Antamasi yhdyskäytävän osoite ei ole tämän laitteen aliverkossa";
GatewayIsNotInSubnetExplanation = "Kirjoita jokin muu IP-osoite, aliverkon peite tai yhdyskäytävän osoite tai pyydä apua järjestelmänvalvojalta.";

AskSaveChangesAlertTitle = "Olet muuttanut näytön asetuksia";
AskSaveChangesAlertMsg = "Haluatko ottaa muutokset käyttöön ennen sen sulkemista?";
AskSaveChangesDontApplyButtonTitle = "Älä käytä";
AskSaveCahngesApplyButtonTitle = "Käytä";

TaskPanelOKButtonTitle = "OK";

EmptyBonjourServiceNameFieldTitle = "\"Bonjour-palvelun nimi\" -kenttää ei voi jättää tyhjäksi";
EmptyBonjourServiceNameFieldMsg = "Määritä Bonjour-palvelun nimi.";
EmptyBonjourDomainNameFieldTitle = "\"Bonjour-toimialueen nimi\" -kenttä ei voi olla tyhjä";
EmptyIPv6DomainNameFieldTitle = "\"IPv6-toimialue\" -kenttä ei voi olla tyhjä";
EmptyBonjourDomainNameFieldMsg = "Määritä Bonjour-toimialueen nimi.";
EmptyBonjourServiceAndDomainNamesFieldTitle = "Kentät \"Bonjour-palvelun nimi\" ja \"Bonjour-toimialueen nimi\" on täytettävä";
EmptyBonjourServiceAndDomainNamesFieldMsg = "Määritä Bonjour-palvelunimi ja -verkkotunnus.";
UsedServiceNameTitle = "Määritetty Bonjour-palvelun nimi on jo käytössä.";
UsedServiceNameMsg = "Määritä toinen Bonjour-palvelun nimi tai pyydä apua verkonvalvojalta.";
HSDBonjourDomainNameTitle = "Bonjour-toimialueen nimi:";

// layout
HSDIPv4Title = "IPv4-asetukset";
HSDIPvXDisableNotAvailableDescription = "IPv4 ja IPv6 eivät voi olla poissa käytöstä samanaikaisesti.";
HSDEnableIPv4InPrinterTitle = "Käytä IPv4-protokollaa kirjoittimessa";
HSDConfigTitle = "Määritys:";
HSDNameTitle = "Isäntänimi:";
HSDAddressTitle = "IP-osoite:";
HSDMaskTitle = "Aliverkon peite:";
HSDGatewayTitle = "Oletusyhdyskäytävä:";
ManualTitle = "Manuaalinen";
Auto = "Automaattinen";

HSDAdditionalSettingsTitle = "Verkon lisäasetukset";
HSDAdditionalSettingsDescription = "Voit hakea tulostimen upotetun Web-palvelimen verkkoasetusten sivun napsauttamalla Verkon lisäasetukset -painiketta. Tällä sivulla voit määrittää 802.1X-, SNMP-asetukset sekä muut verkkoasetukset.";
HSDAdditionalSettingsButton = "Verkon lisäasetukset";

BonjourSettingsTitle = "Bonjour-asetukset";
HSDEnableBonjourTitle = "Ota Bonjour Käyttöön";
HSDBonjourServiceNameTitle = "Bonjour-palvelun nimi:";
HSDPriorityTitle = "Korkein Prioriteettipalvelu:";
HSDAccessTitle = "Liitä laite URL:ään:";

PreviousValueString = "Aikaisempaa arvoa käytetään";

HSDEnableIPv6InPrinterTitle = "Käytä IPv6-protokollaa kirjoittimessa";
HSDDHCPv6PolicyTitle = "DHCPv6 -käytäntö:";
HSDIPv6DomainTitle = " IPv6-toimialue:";
HSDPrimaryDNSServerTitle = "Ensisijainen DNS-palvelin:";
HSDSecondaryDNSServerTitle = "Toissijainen DNS-palvelin:";
HSDPrefixLengthTitle = "Etuliitteen pituus:";
HSDAdditionalAddressesButton = "Lisäosoitteet";
HSDPolicyPopUpItem1 = "Käytä aina DHCPv6:tta käynnistyksessä";
HSDPolicyPopUpItem2 = "Käytä DHCPv6:tta, kun tilaton määritys ei onnistu";
HSDPolicyPopUpItem3 = "Käytä DHCPv6:tta vain kun reititin pyytää sitä";

HSDColumnConfigBy = "Konfigurointi";
HSDColumnAddresses = "Osoite";
HSDColumnPrefix = "Etuliitteen pituus";
HSDCloseButton = "Sulje";

HSDApplyButton = "Ota käyttöön";

LINK_LOCAL = "Linkki paikallinen";
HSDNotAvailableLabel = "Verkkoasetukset-tehtävä ei ole tällä hetkellä käytettävissä.\nVarmista, että laite on yhdistetty verkkoon.";
